[{"content":"adb-translate  项目地址：https://github.com/rentianyu/adb-translate  一、项目简介 此开源项目由QQ群773276432发起的ADB有关命令的翻译及其使用，目前还在建设中，希望大家能够贡献自己的一份力量，使之成为将来ADB命令的查询手册，方便大家查询。加油吧，搞机人！\n本adb翻译文档网址：https://rentianyu.github.io/adb-translate\n二、项目介绍   翻译文档在posts中\n  文章编辑采用 MarkDown 格式\n  ","date":1508426775,"description":"","lastmod":"2019-10-26T15:26:15Z","objectID":"3976528693a0108357f4928017600865","permalink":"https://rentianyu.github.io/adb-translate/","publishdate":"2018-11-23T15:26:15Z","title":"项目介绍"},{"content":"暂时不知道写啥，先空着吧 ","date":1397001600,"description":"","lastmod":"2014-04-09T00:00:00Z","objectID":"6083a88ee3411b0d17ce02d738f69d47","permalink":"https://rentianyu.github.io/adb-translate/about/","publishdate":"2014-04-09T00:00:00Z","title":"关于"},{"content":"   命令 英文 翻译     am Activity manager 活动管理器   appops AppOps service 软件权限服务   busybox     cmd     dpm     dumpsys     getprop     logcat     pm Package manager 软件包管理器   screencap     screenrecord     service     setenforce     setprop     settings     svc     telecom     toybox     wm                               ","date":1607691735,"description":"","lastmod":"2020-12-11T21:02:15+08:00","objectID":"fe776fb95ae2973bc299aa1f0899d59a","permalink":"https://rentianyu.github.io/adb-translate/adb/","publishdate":"2020-12-11T21:02:15+08:00","title":"命令目录"},{"content":"C:\\Users\\Admin\u0026amp;gt;adb Android Debug Bridge version 1.0.41 Version 30.0.5-6877874 Installed as C:\\Users\\Admin\\scoop\\apps\\adb\\current\\platform-tools\\adb.exe global options: -a listen on all network interfaces, not just localhost -d use USB device (error if multiple devices connected) -e use TCP/IP device (error if multiple TCP/IP devices available) -s SERIAL use device with given serial (overrides $ANDROID_SERIAL) -t ID use device with given transport id -H name of adb server host [default=localhost] -P port of adb server [default=5037] -L SOCKET listen on given socket for adb server [default=tcp:localhost:5037] general commands: devices [-l] list connected devices (-l for long output) help show this help message version show version num networking: connect HOST[:PORT] connect to a device via TCP/IP [default port=5555] disconnect [HOST[:PORT]] disconnect from given TCP/IP device [default port=5555], or all pair HOST[:PORT] [PAIRING CODE] pair with a device for secure TCP/IP communication forward --list list all forward socket connections forward [--no-rebind] LOCAL REMOTE forward socket connection using: tcp:\u0026amp;lt;port\u0026amp;gt; (\u0026amp;lt;local\u0026amp;gt; may be \u0026amp;#34;tcp:0\u0026amp;#34; to pick any open port) localabstract:\u0026amp;lt;unix domain socket name\u0026amp;gt; localreserved:\u0026amp;lt;unix domain socket name\u0026amp;gt; localfilesystem:\u0026amp;lt;unix domain socket name\u0026amp;gt; dev:\u0026amp;lt;character device name\u0026amp;gt; jdwp:\u0026amp;lt;process pid\u0026amp;gt; (remote only) acceptfd:\u0026amp;lt;fd\u0026amp;gt; (listen only) forward --remove LOCAL remove specific forward socket connection forward --remove-all remove all forward socket connections ppp TTY [PARAMETER...] run PPP over USB reverse --list list all reverse socket connections from device reverse [--no-rebind] REMOTE LOCAL reverse socket connection using: tcp:\u0026amp;lt;port\u0026amp;gt; (\u0026amp;lt;remote\u0026amp;gt; may be \u0026amp;#34;tcp:0\u0026amp;#34; to pick any open port) localabstract:\u0026amp;lt;unix domain socket name\u0026amp;gt; localreserved:\u0026amp;lt;unix domain socket name\u0026amp;gt; localfilesystem:\u0026amp;lt;unix domain socket name\u0026amp;gt; reverse --remove REMOTE remove specific …","date":1607691735,"description":"","lastmod":"2020-12-11T21:02:15+08:00","objectID":"970aef9c3ba23144c4ada2a3c06d75c0","permalink":"https://rentianyu.github.io/adb-translate/adb/adb/","publishdate":"2020-12-11T21:02:15+08:00","title":"Adb"},{"content":":/system/bin # am Activity manager (activity) commands: help Print this help text. start-activity [-D] [-N] [-W] [-P \u0026amp;lt;FILE\u0026amp;gt;] [--start-profiler \u0026amp;lt;FILE\u0026amp;gt;] [--sampling INTERVAL] [--streaming] [-R COUNT] [-S] [--track-allocation] [--user \u0026amp;lt;USER_ID\u0026amp;gt; | current] \u0026amp;lt;INTENT\u0026amp;gt; Start an Activity. Options are: -D: enable debugging -N: enable native debugging -W: wait for launch to complete --start-profiler \u0026amp;lt;FILE\u0026amp;gt;: start profiler and send results to \u0026amp;lt;FILE\u0026amp;gt; --sampling INTERVAL: use sample profiling with INTERVAL microseconds between samples (use with --start-profiler) --streaming: stream the profiling output to the specified file (use with --start-profiler) -P \u0026amp;lt;FILE\u0026amp;gt;: like above, but profiling stops when app goes idle --attach-agent \u0026amp;lt;agent\u0026amp;gt;: attach the given agent before binding --attach-agent-bind \u0026amp;lt;agent\u0026amp;gt;: attach the given agent during binding -R: repeat the activity launch \u0026amp;lt;COUNT\u0026amp;gt; times. Prior to each repeat, the top activity will be finished. -S: force stop the target app before starting the activity --track-allocation: enable tracking of object allocations --user \u0026amp;lt;USER_ID\u0026amp;gt; | current: Specify which user to run as; if not specified then run as the current user. --windowingMode \u0026amp;lt;WINDOWING_MODE\u0026amp;gt;: The windowing mode to launch the activity into. --activityType \u0026amp;lt;ACTIVITY_TYPE\u0026amp;gt;: The activity type to launch the activity as. start-service [--user \u0026amp;lt;USER_ID\u0026amp;gt; | current] \u0026amp;lt;INTENT\u0026amp;gt; Start a Service. Options are: --user \u0026amp;lt;USER_ID\u0026amp;gt; | current: Specify which user to run as; if not specified then run as the current user. start-foreground-service [--user \u0026amp;lt;USER_ID\u0026amp;gt; | current] \u0026amp;lt;INTENT\u0026amp;gt; Start a foreground Service. Options are: --user \u0026amp;lt;USER_ID\u0026amp;gt; | current: Specify which user to run as; if not specified then run as the current user. stop-service [--user \u0026amp;lt;USER_ID\u0026amp;gt; | current] \u0026amp;lt;INTENT\u0026amp;gt; Stop a Service. Options are: --user \u0026amp;lt;USER_ID\u0026amp;gt; | current: Specify which user to run as; if not …","date":1607691536,"description":"","lastmod":"2020-12-11T20:58:56+08:00","objectID":"66e6babb9a412d6de9973e3ff18bd5c4","permalink":"https://rentianyu.github.io/adb-translate/adb/am/","publishdate":"2020-12-11T20:58:56+08:00","title":"Am"},{"content":":/system/bin # appops AppOps service (appops) commands: help Print this help text. start [--user \u0026amp;lt;USER_ID\u0026amp;gt;] \u0026amp;lt;PACKAGE | UID\u0026amp;gt; \u0026amp;lt;OP\u0026amp;gt; Starts a given operation for a particular application. stop [--user \u0026amp;lt;USER_ID\u0026amp;gt;] \u0026amp;lt;PACKAGE | UID\u0026amp;gt; \u0026amp;lt;OP\u0026amp;gt; Stops a given operation for a particular application. set [--user \u0026amp;lt;USER_ID\u0026amp;gt;] \u0026amp;lt;PACKAGE | UID\u0026amp;gt; \u0026amp;lt;OP\u0026amp;gt; \u0026amp;lt;MODE\u0026amp;gt; Set the mode for a particular application and operation. get [--user \u0026amp;lt;USER_ID\u0026amp;gt;] \u0026amp;lt;PACKAGE | UID\u0026amp;gt; [\u0026amp;lt;OP\u0026amp;gt;] Return the mode for a particular application and optional operation. query-op [--user \u0026amp;lt;USER_ID\u0026amp;gt;] \u0026amp;lt;OP\u0026amp;gt; [\u0026amp;lt;MODE\u0026amp;gt;] Print all packages that currently have the given op in the given mode. reset [--user \u0026amp;lt;USER_ID\u0026amp;gt;] [\u0026amp;lt;PACKAGE\u0026amp;gt;] Reset the given application or all applications to default modes. write-settings Immediately write pending changes to storage. read-settings Read the last written settings, replacing current state in RAM. options: \u0026amp;lt;PACKAGE\u0026amp;gt; an Android package name. \u0026amp;lt;OP\u0026amp;gt; an AppOps operation. \u0026amp;lt;MODE\u0026amp;gt; one of allow, ignore, deny, or default \u0026amp;lt;USER_ID\u0026amp;gt; the user id under which the package is installed. If --user is not specified, the current user is assumed. ","date":1607691536,"description":"","lastmod":"2020-12-11T20:58:56+08:00","objectID":"bfdd4a7abf137c67ae43074e9c76af31","permalink":"https://rentianyu.github.io/adb-translate/adb/appops/","publishdate":"2020-12-11T20:58:56+08:00","title":"Appops"},{"content":":/system/bin # busybox BusyBox v1.31.1-osm0sis (2020-05-06 20:45:25 ADT) multi-call binary. BusyBox is copyrighted by many authors between 1998-2015. Licensed under GPLv2. See source distribution for detailed copyright notices. Usage: busybox [function [arguments]...] or: busybox --list[-full] or: busybox --show SCRIPT or: busybox --install [-s] [DIR] or: function [arguments]... BusyBox is a multi-call binary that combines many common Unix utilities into a single executable. Most people will create a link to busybox for each function they wish to use and BusyBox will act like whatever it was invoked as. Currently defined functions: [, [[, acpid, adjtimex, ar, arch, arp, arping, ash, awk, base64, basename, bbconfig, beep, blkdiscard, blkid, blockdev, brctl, bunzip2, bzcat, bzip2, cal, cat, chat, chattr, chcon, chgrp, chmod, chown, chroot, chrt, chvt, cksum, clear, cmp, comm, conspy, cp, cpio, crond, crontab, cttyhack, cut, date, dc, dd, deallocvt, depmod, devmem, df, dhcprelay, diff, dirname, dmesg, dnsd, dnsdomainname, dos2unix, du, dumpkmap, dumpleases, echo, ed, egrep, eject, env, ether-wake, expand, expr, factor, fakeidentd, false, fatattr, fbset, fbsplash, fdflush, fdformat, fdisk, fgconsole, fgrep, find, findfs, flash_eraseall, flash_lock, flash_unlock, flock, fold, free, freeramdisk, fsck, fsck.minix, fsfreeze, fstrim, fsync, ftpd, ftpget, ftpput, fuser, getenforce, getopt, grep, groups, gunzip, gzip, hd, hdparm, head, hexdump, hexedit, hostname, httpd, hush, hwclock, id, ifconfig, ifdown, ifenslave, ifplugd, ifup, inetd, inotifyd, insmod, install, ionice, iostat, ip, ipaddr, ipcalc, ipcrm, ipcs, iplink, ipneigh, iproute, iprule, iptunnel, kbd_mode, kill, killall, killall5, klogd, less, link, ln, loadfont, loadkmap, logread, losetup, ls, lsattr, lsmod, lsof, lspci, lsscsi, lsusb, lzcat, lzma, lzop, lzopcat, makedevs, makemime, man, md5sum, mesg, microcom, mkdir, mkdosfs, mke2fs, mkfifo, mkfs.ext2, mkfs.minix, mkfs.reiser, mkfs.vfat, mknod, mkswap, mktemp, …","date":1607691536,"description":"","lastmod":"2020-12-11T20:58:56+08:00","objectID":"ce0b61341bc4d7622867d585110515a0","permalink":"https://rentianyu.github.io/adb-translate/adb/busybox/","publishdate":"2020-12-11T20:58:56+08:00","title":"Busybox"},{"content":":/system/bin # cmd cmd: No service specified; use -l to list all services 20|:/system/bin # cmd -l Currently running services: DockObserver MiuiBackup MiuiInit ProcessManager SurfaceFlinger accessibility account activity alarm android.security.keystore android.service.gatekeeper.IGateKeeperService appops appwidget audio autofill backup battery batteryproperties batterystats binder_calls_stats bluetooth_manager carrier_config clipboard cneservice com.goodix.FingerprintService com.qualcomm.location.izat.IzatService commontime_management companiondevice connectivity connmetrics consumer_ir content contexthub country_detector cpuinfo crossprofileapps dbinfo device_identifiers device_policy deviceidle devicestoragemonitor diskstats display dpmservice dreams drm.drmManager dropbox ethernet extphone fingerprint gfxinfo gpu graphicsstats hardware_properties imms incident input input_method installd iphonesubinfo ipsec isms isub jobscheduler launcherapps location locationpolicy lock_settings media.audio_flinger media.audio_policy media.camera media.camera.proxy media.drm media.extractor media.metrics media.player media.resource_manager media.sound_trigger_hw media_projection media_resource_monitor media_router media_session meminfo midi miui.contentcatcher.ContentCatcherService miui.face.FaceService miui.fdpp miui.mqsas.IMQSNative miui.mqsas.MQSService miui.sedc miui.shell miui.whetstone.klo miui.whetstone.mcd miui.whetstone.power miuiboosterservice mount netd netd_listener netpolicy netstats network_management network_score network_time_update_service network_watchlist nfc notification oem_lock otadexopt overlay package package_native perfshielder permission persistent_data_block phone pinner power print processinfo procstats qti.ims.ext recovery restrictions scheduling_policy search sec_key_att_app_id_provider secure_element security sensorservice serial servicediscovery settings shortcut simphonebook sip slice soundtrigger stats statscompanion statusbar storaged …","date":1607691537,"description":"","lastmod":"2020-12-11T20:58:57+08:00","objectID":"081462a61ea3e73377d59337c8f85889","permalink":"https://rentianyu.github.io/adb-translate/adb/cmd/","publishdate":"2020-12-11T20:58:57+08:00","title":"Cmd"},{"content":":/system/bin # dpm usage: dpm [subcommand] [options] usage: dpm set-active-admin [ --user \u0026amp;lt;USER_ID\u0026amp;gt; | current ] \u0026amp;lt;COMPONENT\u0026amp;gt; usage: dpm set-device-owner [ --user \u0026amp;lt;USER_ID\u0026amp;gt; | current *EXPERIMENTAL* ] [ --name \u0026amp;lt;NAME\u0026amp;gt; ] \u0026amp;lt;COMPONENT\u0026amp;gt; usage: dpm set-profile-owner [ --user \u0026amp;lt;USER_ID\u0026amp;gt; | current ] [ --name \u0026amp;lt;NAME\u0026amp;gt; ] \u0026amp;lt;COMPONENT\u0026amp;gt; usage: dpm remove-active-admin [ --user \u0026amp;lt;USER_ID\u0026amp;gt; | current ] [ --name \u0026amp;lt;NAME\u0026amp;gt; ] \u0026amp;lt;COMPONENT\u0026amp;gt; dpm set-active-admin: Sets the given component as active admin for an existing user. dpm set-device-owner: Sets the given component as active admin, and its package as device owner. dpm set-profile-owner: Sets the given component as active admin and profile owner for an existing user. dpm remove-active-admin: Disables an active admin, the admin must have declared android:testOnly in the application in its manifest. This will also remove device and profile owners. dpm clear-freeze-period-record: clears framework-maintained record of past freeze periods that the device went through. For use during feature development to prevent triggering restriction on setting freeze periods. dpm force-security-logs: makes all security logs available to the DPC and triggers DeviceAdminReceiver.onSecurityLogsAvailable() if needed. ","date":1607691537,"description":"","lastmod":"2020-12-11T20:58:57+08:00","objectID":"f95229dca3e03193b67d34e69ccdd567","permalink":"https://rentianyu.github.io/adb-translate/adb/dpm/","publishdate":"2020-12-11T20:58:57+08:00","title":"Dpm"},{"content":":/system/bin # dumpsys --help usage: dumpsys To dump all services. or: dumpsys [-t TIMEOUT] [--priority LEVEL] [--help | -l | --skip SERVICES | SERVICE [ARGS]] --help: shows this help -l: only list services, do not dump them -t TIMEOUT_SEC: TIMEOUT to use in seconds instead of default 10 seconds -T TIMEOUT_MS: TIMEOUT to use in milliseconds instead of default 10 seconds --proto: filter services that support dumping data in proto format. Dumps will be in proto format. --priority LEVEL: filter services based on specified priority LEVEL must be one of CRITICAL | HIGH | NORMAL --skip SERVICES: dumps all services but SERVICES (comma-separated list) SERVICE [ARGS]: dumps only service SERVICE, optionally passing ARGS to it ","date":1607691537,"description":"","lastmod":"2020-12-11T20:58:57+08:00","objectID":"63a050ac9b6d424726ad73d2833bce4a","permalink":"https://rentianyu.github.io/adb-translate/adb/dumpsys/","publishdate":"2020-12-11T20:58:57+08:00","title":"Dumpsys"},{"content":":/system/bin # getprop --help usage: getprop [-TZ] [NAME [DEFAULT]] Gets an Android system property, or lists them all. -T Show property types instead of values -Z Show property contexts instead of values ","date":1607691537,"description":"","lastmod":"2020-12-11T20:58:57+08:00","objectID":"405b8a7381beaffa2203114f71de1d81","permalink":"https://rentianyu.github.io/adb-translate/adb/getprop/","publishdate":"2020-12-11T20:58:57+08:00","title":"Getprop"},{"content":":/system/bin # logcat --help Usage: logcat [options] [filterspecs] options include: -s Set default filter to silent. Equivalent to filterspec \u0026amp;#39;*:S\u0026amp;#39; -f \u0026amp;lt;file\u0026amp;gt;, --file=\u0026amp;lt;file\u0026amp;gt; Log to file. Default is stdout -r \u0026amp;lt;kbytes\u0026amp;gt;, --rotate-kbytes=\u0026amp;lt;kbytes\u0026amp;gt; Rotate log every kbytes. Requires -f option -n \u0026amp;lt;count\u0026amp;gt;, --rotate-count=\u0026amp;lt;count\u0026amp;gt; Sets max number of rotated logs to \u0026amp;lt;count\u0026amp;gt;, default 4 --id=\u0026amp;lt;id\u0026amp;gt; If the signature id for logging to file changes, then clear the fileset and continue -v \u0026amp;lt;format\u0026amp;gt;, --format=\u0026amp;lt;format\u0026amp;gt; Sets log print format verb and adverbs, where \u0026amp;lt;format\u0026amp;gt; is: brief help long process raw tag thread threadtime time and individually flagged modifying adverbs can be added: color descriptive epoch monotonic printable uid usec UTC year zone Multiple -v parameters or comma separated list of format and format modifiers are allowed. -D, --dividers Print dividers between each log buffer -c, --clear Clear (flush) the entire log and exit if Log to File specified, clear fileset instead -d Dump the log and then exit (don\u0026amp;#39;t block) -e \u0026amp;lt;expr\u0026amp;gt;, --regex=\u0026amp;lt;expr\u0026amp;gt; Only print lines where the log message matches \u0026amp;lt;expr\u0026amp;gt; where \u0026amp;lt;expr\u0026amp;gt; is a Perl-compatible regular expression -m \u0026amp;lt;count\u0026amp;gt;, --max-count=\u0026amp;lt;count\u0026amp;gt; Quit after printing \u0026amp;lt;count\u0026amp;gt; lines. This is meant to be paired with --regex, but will work on its own. --print Paired with --regex and --max-count to let content bypass regex filter but still stop at number of matches. -t \u0026amp;lt;count\u0026amp;gt; Print only the most recent \u0026amp;lt;count\u0026amp;gt; lines (implies -d) -t \u0026amp;#39;\u0026amp;lt;time\u0026amp;gt;\u0026amp;#39; Print most recent lines since specified time (implies -d) -T \u0026amp;lt;count\u0026amp;gt; Print only the most recent \u0026amp;lt;count\u0026amp;gt; lines (does not imply -d) -T \u0026amp;#39;\u0026amp;lt;time\u0026amp;gt;\u0026amp;#39; Print most recent lines since specified time (not imply -d) count is pure numerical, time is \u0026amp;#39;MM-DD hh:mm:ss.mmm...\u0026amp;#39; \u0026amp;#39;YYYY-MM-DD hh:mm:ss.mmm...\u0026amp;#39; or \u0026amp;#39;sssss.mmm...\u0026amp;#39; format -g, …","date":1607691538,"description":"","lastmod":"2020-12-11T20:58:58+08:00","objectID":"77ce1a42a4b1d2c7f29b5f9c0ba9e41f","permalink":"https://rentianyu.github.io/adb-translate/adb/logcat/","publishdate":"2020-12-11T20:58:58+08:00","title":"Logcat"},{"content":":/system/bin # pm Package manager (package) commands: help Print this help text. path [--user USER_ID] PACKAGE Print the path to the .apk of the given PACKAGE. dump PACKAGE Print various system state associated with the given PACKAGE. list features Prints all features of the system. has-feature FEATURE_NAME [version] Prints true and returns exit status 0 when system has a FEATURE_NAME, otherwise prints false and returns exit status 1 list instrumentation [-f] [TARGET-PACKAGE] Prints all test packages; optionally only those targeting TARGET-PACKAGE Options: -f: dump the name of the .apk file containing the test package list libraries Prints all system libraries. list packages [-f] [-d] [-e] [-s] [-3] [-i] [-l] [-u] [-U] [--uid UID] [--user USER_ID] [FILTER] Prints all packages; optionally only those whose name contains the text in FILTER. Options are: -f: see their associated file -d: filter to only show disabled packages -e: filter to only show enabled packages -s: filter to only show system packages -3: filter to only show third party packages -i: see the installer for the packages -l: ignored (used for compatibility with older releases) -U: also show the package UID -u: also include uninstalled packages --uid UID: filter to only show packages with the given UID --user USER_ID: only list packages belonging to the given user list permission-groups Prints all known permission groups. list permissions [-g] [-f] [-d] [-u] [GROUP] Prints all known permissions; optionally only those in GROUP. Options are: -g: organize by group -f: print all information -s: short summary -d: only list dangerous permissions -u: list only the permissions users will see resolve-activity [--brief] [--components] [--user USER_ID] INTENT Prints the activity that resolves to the given INTENT. query-activities [--brief] [--components] [--user USER_ID] INTENT Prints all activities that can handle the given INTENT. query-services [--brief] [--components] [--user USER_ID] INTENT Prints all services …","date":1607691538,"description":"","lastmod":"2020-12-11T20:58:58+08:00","objectID":"862b7610c305af60521b5a92823d53ad","permalink":"https://rentianyu.github.io/adb-translate/adb/pm/","publishdate":"2020-12-11T20:58:58+08:00","title":"Pm"},{"content":":/system/bin # screencap -h usage: screencap [-hp] [-d display-id] [FILENAME] -h: this message -p: save the file as a png. -d: specify the display id to capture, default 0. If FILENAME ends with .png it will be saved as a png. If FILENAME is not given, the results will be printed to stdout. ","date":1607691538,"description":"","lastmod":"2020-12-11T20:58:58+08:00","objectID":"d8544405a89a57bcdacd125e2c432e79","permalink":"https://rentianyu.github.io/adb-translate/adb/screencap/","publishdate":"2020-12-11T20:58:58+08:00","title":"Screencap"},{"content":":/system/bin # screenrecord --help Usage: screenrecord [options] \u0026amp;lt;filename\u0026amp;gt; Android screenrecord v1.2. Records the device\u0026amp;#39;s display to a .mp4 file. Options: --size WIDTHxHEIGHT Set the video size, e.g. \u0026amp;#34;1280x720\u0026amp;#34;. Default is the device\u0026amp;#39;s main display resolution (if supported), 1280x720 if not. For best results, use a size supported by the AVC encoder. --bit-rate RATE Set the video bit rate, in bits per second. Value may be specified as bits or megabits, e.g. \u0026amp;#39;4000000\u0026amp;#39; is equivalent to \u0026amp;#39;4M\u0026amp;#39;. Default 20Mbps. --bugreport Add additional information, such as a timestamp overlay, that is helpful in videos captured to illustrate bugs. --time-limit TIME Set the maximum recording time, in seconds. Default / maximum is 180. --verbose Display interesting information on stdout. --help Show this message. Recording continues until Ctrl-C is hit or the time limit is reached. ","date":1607691539,"description":"","lastmod":"2020-12-11T20:58:59+08:00","objectID":"44ea53f58467ca4c95e7934aedb5b552","permalink":"https://rentianyu.github.io/adb-translate/adb/screenrecord/","publishdate":"2020-12-11T20:58:59+08:00","title":"Screenrecord"},{"content":":/system/bin # service -h Usage: service [-h|-?] service list service check SERVICE service call SERVICE CODE [i32 N | i64 N | f N | d N | s16 STR ] ... Options: i32: Write the 32-bit integer N into the send parcel. i64: Write the 64-bit integer N into the send parcel. f: Write the 32-bit single-precision number N into the send parcel. d: Write the 64-bit double-precision number N into the send parcel. s16: Write the UTF-16 string STR into the send parcel. ","date":1607691539,"description":"","lastmod":"2020-12-11T20:58:59+08:00","objectID":"d25ede445ef5d0822ffc8a4789877a18","permalink":"https://rentianyu.github.io/adb-translate/adb/service/","publishdate":"2020-12-11T20:58:59+08:00","title":"Service"},{"content":":/system/bin # setenforce --help usage: setenforce [enforcing|permissive|1|0] Sets whether SELinux is enforcing (1) or permissive (0). ","date":1607691539,"description":"","lastmod":"2020-12-11T20:58:59+08:00","objectID":"5894987f1236f6ec8257ca89f7c1efb5","permalink":"https://rentianyu.github.io/adb-translate/adb/setenforce/","publishdate":"2020-12-11T20:58:59+08:00","title":"Setenforce"},{"content":":/system/bin # setprop --help usage: setprop NAME VALUE Sets an Android system property. ","date":1607691539,"description":"","lastmod":"2020-12-11T20:58:59+08:00","objectID":"ca5ec44d56ff4c1f3c9c691989c8b8c1","permalink":"https://rentianyu.github.io/adb-translate/adb/setprop/","publishdate":"2020-12-11T20:58:59+08:00","title":"Setprop"},{"content":":/system/bin # settings Settings provider (settings) commands: help Print this help text. get [--user \u0026amp;lt;USER_ID\u0026amp;gt; | current] NAMESPACE KEY Retrieve the current value of KEY. put [--user \u0026amp;lt;USER_ID\u0026amp;gt; | current] NAMESPACE KEY VALUE [TAG] [default] Change the contents of KEY to VALUE. TAG to associate with the setting. {default} to set as the default, case-insensitive only for global/secure namespace delete NAMESPACE KEY Delete the entry for KEY. reset [--user \u0026amp;lt;USER_ID\u0026amp;gt; | current] NAMESPACE {PACKAGE_NAME | RESET_MODE} Reset the global/secure table for a package with mode. RESET_MODE is one of {untrusted_defaults, untrusted_clear, trusted_defaults}, case-insensitive list NAMESPACE Print all defined keys. NAMESPACE is one of {system, secure, global}, case-insensitive ","date":1607691540,"description":"","lastmod":"2020-12-11T20:59:00+08:00","objectID":"66d862d7d18cc328f8dcd7d503fb3906","permalink":"https://rentianyu.github.io/adb-translate/adb/settings/","publishdate":"2020-12-11T20:59:00+08:00","title":"Settings"},{"content":":/system/bin # svc Available commands: help Show information about the subcommands power Control the power manager data Control mobile data connectivity wifi Control the Wi-Fi manager usb Control Usb state nfc Control NFC functions bluetooth Control Bluetooth service ","date":1607691540,"description":"","lastmod":"2020-12-11T20:59:00+08:00","objectID":"f6a9fc526465855ae57be551249f7309","permalink":"https://rentianyu.github.io/adb-translate/adb/svc/","publishdate":"2020-12-11T20:59:00+08:00","title":"Svc"},{"content":":/system/bin # telecom usage: telecom [subcommand] [options] usage: telecom set-phone-account-enabled \u0026amp;lt;COMPONENT\u0026amp;gt; \u0026amp;lt;ID\u0026amp;gt; \u0026amp;lt;USER_SN\u0026amp;gt; usage: telecom set-phone-account-disabled \u0026amp;lt;COMPONENT\u0026amp;gt; \u0026amp;lt;ID\u0026amp;gt; \u0026amp;lt;USER_SN\u0026amp;gt; usage: telecom register-phone-account \u0026amp;lt;COMPONENT\u0026amp;gt; \u0026amp;lt;ID\u0026amp;gt; \u0026amp;lt;USER_SN\u0026amp;gt; \u0026amp;lt;LABEL\u0026amp;gt; usage: telecom register-sim-phone-account \u0026amp;lt;COMPONENT\u0026amp;gt; \u0026amp;lt;ID\u0026amp;gt; \u0026amp;lt;USER_SN\u0026amp;gt; \u0026amp;lt;LABEL\u0026amp;gt; \u0026amp;lt;ADDRESS\u0026amp;gt; usage: telecom unregister-phone-account \u0026amp;lt;COMPONENT\u0026amp;gt; \u0026amp;lt;ID\u0026amp;gt; \u0026amp;lt;USER_SN\u0026amp;gt; usage: telecom set-default-dialer \u0026amp;lt;PACKAGE\u0026amp;gt; usage: telecom get-default-dialer usage: telecom get-system-dialer usage: telecom wait-on-handlers telecom set-phone-account-enabled: Enables the given phone account, if it has already been registered with Telecom. telecom set-phone-account-disabled: Disables the given phone account, if it has already been registered with telecom. telecom set-default-dialer: Sets the default dialer to the given component. telecom get-default-dialer: Displays the current default dialer. telecom get-system-dialer: Displays the current system dialer. telecom wait-on-handlers: Wait until all handlers finish their work. ","date":1607691540,"description":"","lastmod":"2020-12-11T20:59:00+08:00","objectID":"f95728385f4d13d3e5b3ff86f7e2421f","permalink":"https://rentianyu.github.io/adb-translate/adb/telecom/","publishdate":"2020-12-11T20:59:00+08:00","title":"Telecom"},{"content":":/system/bin # toybox acpi base64 basename blkid blockdev cal cat chattr chcon chgrp chmod chown chroot chrt cksum clear cmp comm cp cpio cut date dd df diff dirname dmesg dos2unix du echo egrep env expand expr fallocate false fgrep file find flock fmt free freeramdisk fsfreeze getenforce getfattr grep groups gunzip gzip head help hostname hwclock id ifconfig inotifyd insmod install ionice iorenice iotop kill killall ln load_policy log logname losetup ls lsattr lsmod lsof lspci lsusb makedevs md5sum microcom mkdir mkfifo mknod mkswap mktemp modinfo modprobe more mount mountpoint mv nbd-client nc netcat netstat nice nl nohup od partprobe paste patch pgrep pidof pivot_root pkill pmap printenv printf ps pwd pwdx readlink realpath renice restorecon rev rfkill rm rmdir rmmod runcon sed sendevent seq setenforce setfattr setprop setsid sha1sum sha224sum sha256sum sha384sum sha512sum sleep sort split start stat stop strings stty swapoff swapon sync sysctl tac tail tar taskset tee time timeout top touch tr traceroute traceroute6 true truncate tty tunctl ulimit umount uname uniq unix2dos uptime usleep uudecode uuencode vconfig vmstat wc which whoami xargs xxd yes zcat ","date":1607691541,"description":"","lastmod":"2020-12-11T20:59:01+08:00","objectID":"4ea3b40715b3ad605fc673c2a719b0d7","permalink":"https://rentianyu.github.io/adb-translate/adb/toybox/","publishdate":"2020-12-11T20:59:01+08:00","title":"Toybox"},{"content":":/system/bin # wm Window manager (window) commands: help Print this help text. size [reset|WxH|WdpxHdp] Return or override display size. width and height in pixels unless suffixed with \u0026amp;#39;dp\u0026amp;#39;. density [reset|DENSITY] Return or override display density. overscan [reset|LEFT,TOP,RIGHT,BOTTOM] Set overscan area for display. scaling [off|auto] Set display scaling mode. dismiss-keyguard Dismiss the keyguard, prompting user for auth if necessary. ","date":1607691543,"description":"","lastmod":"2020-12-11T20:59:03+08:00","objectID":"5ef093102384a9c283e53fdba9e4c531","permalink":"https://rentianyu.github.io/adb-translate/adb/wm/","publishdate":"2020-12-11T20:59:03+08:00","title":"Wm"}]